import random

last_names = ['აბაშიძე', 'გიგაური', 'არჩვაძე', 'ახალაია', 'ბაძაღუა', 'ბერიანიძე', 'ბერიშვილი', 'გვენცაძე', 'დალაქიშვილი',
              'ანთიძე', 'გიორგაძე', 'გოგალაძე', 'გოცირიძე', 'ვარდიძე', 'ზარანდია', 'თადუმაძე', 'ლაბაძე', 'კვარაცხელია',
              'კუსრაძე', 'კვესელავა', 'კაპანაძე', 'კასრაძე', 'კვინიკაძე', 'კოპაძე', 'კანკია', 'კორძაია', 'მიქავა', 'მელია',
              'მონიავა', 'ნიაური', 'ლაცაბიძე', 'მიქაძე', 'ნემსიწვერიძე', 'მაისურაძე', 'მაცაბერიძე', 'მჟავია', 'მაჩალაძე',
              'ოდიშარია', 'მეტრეველი', 'ნეფარიძე', 'მოდებაძე', 'მარჯანიძე', 'მუმლაძე', 'ნასრაშვილი',  'ჯანჯღავა', 'მოსია',
              'ნოზაძე', 'ნუცუბიძე', 'ონიანი', 'ოქრუაშვილი', 'პერტია', 'რაზმაძე', 'რევაზაშვილი', 'საგანელიძე', 'ჯახაია',
              'სალუქვაძე', 'სამსონაშვილი', 'სამხარაძე', 'სარალიძე', 'სართანია', 'სარიშვილი', 'სიმონიშვილი', 'სხილაძე',
              'ხურციძე', 'სიხარულიძე', 'ტაბატაძე', 'ფაცაცია', 'ფილაური', 'ფუხაშვილი', 'ქობალია', 'ყიფშიძე', 'შაინიძე',
              'ფიფია', 'შენგელია', 'შეროზია', 'შველიძე', 'ჩხეიძე', 'ჩადუნელი', 'ჩიკვაშვილი', 'ცქიტიშვილი', 'ჩოკორაია',
              'ცაგურია', 'ცერცვაძე', 'ცუხიშვილი', 'ძინძიბაძე', 'წერეთელი', 'წიკლაური', 'ჭავჭანიძე', 'ჩირაძე', 'ჭელიძე',
              'ჭანტურია', 'სირაძე', 'შონია', 'ხანჯალაძე', 'ხარაზიშვილი', 'ხელაძე', 'ხვინგია', 'ხუციშვილი', 'ჯანელიძე',
              'ჯოხაძე']

g_names = ['ანი', 'ანუკი', 'ბარბარე', 'გვანცა', 'დიანა', 'ეკა', 'ელენე', 'ვერონიკა', 'ვიქტორია', 'თათია', 'ლამზირა',
           'თეა', 'თეკლე', 'თინიკო', 'თამარი', 'იზაბელა', 'ია', 'იამზე', 'ლია', 'ლიკა', 'ლანა', 'მარიკა', 'მანანა',
           'მაია', 'მაკა', 'მარიამი', 'ნანა', 'ნანი', 'ნატა', 'ნატო', 'ნინო', 'ნონა', 'ოლიკო', 'ქეთევანი', 'სალომე',
           'სოფიკო', 'ნია', 'ქრისტინე', 'შორენა', 'ხატია']

b_names = ['ალეკო', 'ალიკა', 'ამირან', 'ანდრია', 'არჩილი', 'ასლანი', 'ბაჩუკი', 'ბექა', 'გიგა', 'გიორგი', 'დავითი',
           'გიგი', 'გოგა', 'დათა', 'ერეკლე', 'თემური', 'იაკობ', 'ილია', 'ირაკლი', 'ლადო', 'ლაშა', 'მიხეილ',
           'ნიკა', 'ოთარი', 'პაატა', 'რამაზ', 'რამინი', 'რატი', 'რაული', 'რევაზი', 'რომა', 'რომანი', 'სანდრო',
           'საბა', 'სერგი', 'სიმონ', 'შალვა', 'შოთა', 'ცოტნე', 'ჯაბა']

consonants = ["ბ", "გ", "დ", "ვ", "ზ", "თ", "კ", "ლ", "მ", "ნ", "ო", "პ", "ჟ",
              "რ", "ს", "ტ", "ფ", "ქ", "ღ", "ყ", "შ", "ჩ", "ც", "ძ", "წ", "ჭ", "ხ", "ჯ", "ჰ"]

vowels = ["ა", "ე", "ი", "ო", "უ"]

names = g_names + b_names
random.shuffle(names)


data = open("data.txt", "w", encoding="utf8")
for person in range(1000):
    data.write(f"{random.choice(names)} {random.choice(last_names)} \n")
data.close()


person = open("data.txt", "r", encoding="utf8")
person_list = person.readlines()
person.close()

countBoy = 0
countGirl = 0


for human in person_list:
    if human.split(" ")[0] in b_names:
        countBoy += 1
    else:
        countGirl += 1


if countGirl > countBoy:
    print("გოგონების რაოდენობა მეტია ვიდრე ბიჭების")
elif countBoy > countGirl:
    print("ბიჭების რაოდენობა მეტია ვიდრე გოგონების")
else:
    print("გოგონების და ბიჭების რაოდენობა თანაბარია")

my_vowel = 0
my_consonant = 0
answer = 0
for human in person_list:
    for i in human.split(" ")[0]:
        if i in vowels:
            my_vowel += 1
        else:
            my_consonant += 1
    if my_consonant > my_vowel:
        answer += 1
    my_vowel = 0
    my_consonant = 0

print(f"სახელთა რაოდენობა, რომელშიც თანხმოვნების რაოდენობა მკაცრად აღემატება ხმოვნების რაოდენობას არის : {answer}")
